;BIO TROOPER
[AdvBioTrooperM1 X2CharacterTemplate]
strCharacterName="Bio Trooper"

[AdvBioTrooperM2 X2CharacterTemplate]
strCharacterName="Advanced Bio Trooper"

[AdvBioTrooperM3 X2CharacterTemplate]
strCharacterName="Elite Bio Trooper"

[AdvBioTrooperFakeM1 X2CharacterTemplate]
strCharacterName="Bio Trooper"

[AdvBioTrooperFakeM2 X2CharacterTemplate]
strCharacterName="Advanced Bio Trooper"

[AdvBioTrooperFakeM3 X2CharacterTemplate]
strCharacterName="Elite Bio Trooper"


;BIO ASSAULT TROOPER
[AdvBioAssaultTrooperM2 X2CharacterTemplate]
strCharacterName="Bio Assault Trooper"

[AdvBioAssaultTrooperM3 X2CharacterTemplate]
strCharacterName="Heavy Bio Assault Trooper"

[AdvBioAssaultTrooperM2B X2CharacterTemplate]
strCharacterName="Bio Assault Trooper"

[AdvBioAssaultTrooperM3B X2CharacterTemplate]
strCharacterName="Heavy Bio Assault Trooper"

[CorpseAdvBioAssaultTrooper X2ItemTemplate]
FriendlyName="<font color='#69CA24'>ADVENT Bio Assault Trooper Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>ADVENT Bio Assault Trooper Corpses</font>"
BriefSummary="The ADVENT Bio Assault Trooper is deadly and very strong. Kill them on sight!"

[AutopsyAdvBioAssaultTrooper X2TechTemplate]
DisplayName="<font color='#69CA24'>ADVENT Bio Assault Trooper Autopsy</font>"
Summary="The ADVENT Bio Assault Trooper among others, seems to be just like any other ADVENT Trooper class. Except, these Bio Troops look to have been given specialty equipment and armor designed to function side by side with the Bio Viper."
CodeName="Bio Rhino"
LongDescription="The ADVENT Bio Assault Trooper or Bio Rhino codenamed in the field for their need to charge through anything to get to you, make these Bio Troops very deadly. They can take a beating and keep coming. They also have a self healing med suit that keeps them up and ready for more!"

[AssaultStun X2AbilityTemplate]
LocFriendlyName="Assault Stun"
LocLongDescription="Slashes a target dealing Stun damage. This could add Stun, Disorient or Unconscious."
LocHelpText="Slash at a single target."
LocFlyOverText="Stun a target."

[BioAssaultTrooperRegeneration X2AbilityTemplate]
LocFriendlyName="Regeneration"
LocLongDescription="The Bio Assault Trooper can regenerate 2 health at the start of its turn."
LocHelpText="The Bio Assault Trooper recovers a small amount of HP every turn."
LocFlyOverText="Regeneration"

[BioShieldBash X2AbilityTemplate]
LocFriendlyName="Shield Bash"
LocLongDescription="Bash a target with the shield. This can add Disorient to target."
LocHelpText="Shield bash a single target."
LocFlyOverText="Bash a target."

[AdvBioShieldDeflect X2AbilityTemplate]
LocFriendlyName="Shield Deflect"
LocLongDescription="Has a chance to deflect ranged and melee attacks with the shield."
LocHelpText="Shield Deflect."




;BIO ROCKET TROOPER
[AdvBioRocketTrooperM2 X2CharacterTemplate]
strCharacterName="Bio Rocket Trooper"

[AdvBioRocketTrooperM3 X2CharacterTemplate]
strCharacterName="Heavy Bio Rocket Trooper"

[CorpseAdvBioRocketTrooper X2ItemTemplate]
FriendlyName="<font color='#69CA24'>ADVENT Bio Rocket Trooper Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>ADVENT Bio Rocket Trooper Corpses</font>"
BriefSummary="The ADVENT Bio Rocket Troopers deploy Bio Rockets. Keep your distance!"

[AutopsyAdvBioRocketTrooper X2TechTemplate]
DisplayName="<font color='#69CA24'>ADVENT Bio Rocket Trooper Autopsy</font>"
Summary="The ADVENT Bio Rocket Trooper among others, seems to be just like any other ADVENT Trooper class. Except, these Bio Troops look to have been given specialty equipment and armor designed to function side by side with the Bio Viper."
CodeName="Bio Stinger"
LongDescription="The ADVENT Bio Rocket Trooper or Bio Stinger codenamed in the field for their Stinger-like arm mounted Bio Rocket they can and will use, make these Bio Troops very deadly. They can be as tough as the Bio Assault Trooper counter parts. But These Rocket Troops will try and stand off to use their Bio Rocket at range before closing the gap. Some have been known to be equiped with added armor to protect themselves from errent explosives."

[Ability_BioRocket X2AbilityTemplate]
LocFriendlyName="Bio Rocket Launcher"
LocLongDescription="Fire a Bio Rocket at target area."
LocHelpText="Fire a Bio Rocket at target area."
LocFlyOverText="Launch Bio Rocket"


;BIO CAPTAIN
[AdvBioCaptainM1 X2CharacterTemplate]
strCharacterName="Bio Captain"

[AdvBioCaptainM2 X2CharacterTemplate]
strCharacterName="Advanced Bio Captain"

[AdvBioCaptainM3 X2CharacterTemplate]
strCharacterName="Elite Bio Captain"

[ToxinSlash X2AbilityTemplate]
LocFriendlyName="Toxin Slash"
LocLongDescription="Slashes a target dealing Bio Toxin damage that will add Poison effects as well a a % chance the Toxin will do neurological damage. This could add Stun, Disorient or Unconscious from the effects of the Toxin in the blood stream."
LocHelpText="Slash at a single target."
LocFlyOverText="Slash at target."


;BIO MEC
[BioMEC X2CharacterTemplate]
strCharacterName="Bio MEC"

[BioBlasterLauncher X2AbilityTemplate]
LocFriendlyName="Bio Blaster Bomb"
LocLongDescription="Fire a guided Bio Blast at target area."
LocHelpText="Fire a guided Bio Blast at target area."
LocFlyOverText="Launch Bio Blaster Bomb"


;BIO MEC TROOPER
[BioMecTrooper X2CharacterTemplate]
strCharacterName="Bio Mec Trooper"

[SecondaryShot X2AbilityTemplate]
LocFriendlyName="Fire Secondary Plasma Shotgun."
LocHelpText="Fire a shot at a target. Plasma rounds may set target on fire."
LocLongDescription="Plasma rounds may set target on fire. Firing this weapon always ends a unit's turn."

[CallBioMecReinforcements X2AbilityTemplate]
LocFriendlyName="Launch Reinforcement Flare"
LocLongDescription="Calls in Bio Mec Reinforcements."
LocHelpText="Call Bio Mec Reinforcements."

[HeavyPlasmathrower X2AbilityTemplate]
LocFriendlyName="Fire Heavy Plasmathrower"
LocHelpText="Spray Plasma flames in a cone-shaped area. Plasma from the Bio Mec Trooper's Elerium Core is discharged when firing this weapon. This both helps the Mec from overheating and deals plasma burns to all targets hit. Does added fire damage over time."
LocLongDescription="Plasma from the Bio Mec Trooper's Elerium Core is discharged when firing this weapon. This both helps the Mec from overheating and deals plasma burns to all targets hit. Does added fire damage over time."




;BIO GENERAL
[AdvBioGeneralM1A X2CharacterTemplate]
strCharacterName="Bio General"

[AdvBioGeneralM2A X2CharacterTemplate]
strCharacterName="Advanced Bio General"

[AdvBioGeneralM3A X2CharacterTemplate]
strCharacterName="Elite Bio General"

[AdvBioGeneralM2B X2CharacterTemplate]
strCharacterName="Advanced Bio General"

[AdvBioGeneralM3B X2CharacterTemplate]
strCharacterName="Elite Bio General"

[AdvBioGeneralM1C X2CharacterTemplate]
strCharacterName="Bio General"

[AdvBioGeneralM2C X2CharacterTemplate]
strCharacterName="Advanced Bio General"

[AdvBioGeneralM3C X2CharacterTemplate]
strCharacterName="Elite Bio General"

[AdvBioGeneralM2D X2CharacterTemplate]
strCharacterName="Advanced Bio General"

[AdvBioGeneralM3D X2CharacterTemplate]
strCharacterName="Elite Bio General"

[CorpseAdvBioGeneral X2ItemTemplate]
FriendlyName="<font color='#69CA24'>ADVENT Bio General Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>ADVENT Bio General Corpses</font>"
BriefSummary="The ADVENT Bio General is of the highest rank in the Bio Division. They bring with them the added ability to call in Bio Troop Reinforcements and or contol ADVENT Orbital Weapon Satellites."

[AutopsyAdvBioGeneral X2TechTemplate]
DisplayName="<font color='#69CA24'>ADVENT Bio General Autopsy</font>"
Summary="The ADVENT Bio General is by far, the deadliest Bio Soldier ADVENT has to offer yet. They not only keep the gas and acid immunities, but are immune to mental attacks as well."
CodeName="Bio Boss"
LongDescription="The ADVENT Bio Generals are by far the most deadly Bio Soldier we have faced Commander. Not only do they keep their gas and acid immunities, they are also immune to mental attacks. What makes them most threatening is the fact that they can call in Bio Troop reinforcements and or have the ability to use an Orbital Weapon Satellite to target our soldiers on the ground. If Shen can manage to hack into one of these Satellites, we might be able to use it ourselves. The one issue I see is that once we hack into the Satellite's systems, I'm sure there will be a built in failsafe to cut us off from using their own Bio munitions on them. But we should still be able to use the Satellite's main weapons arry. R. Tygan."

[CallBioReinforcementsM1 X2AbilityTemplate]
LocFriendlyName="Bio Reinforcements"
LocLongDescription="Calls in Bio Reinforcements."
LocHelpText="Call Bio Reinforcements."
LocFlyOverText="Call Bio Reinforcements"

[CallBioReinforcementsM2 X2AbilityTemplate]
LocFriendlyName="Bio Reinforcements"
LocLongDescription="Calls in Bio Reinforcements."
LocHelpText="Call Bio Reinforcements."
LocFlyOverText="Call Bio Reinforcements"

[CallBioReinforcementsM3 X2AbilityTemplate]
LocFriendlyName="Bio Reinforcements"
LocLongDescription="Calls in Bio Reinforcements."
LocHelpText="Call Bio Reinforcements."
LocFlyOverText="Call Bio Reinforcements"

[CallGasStrike X2AbilityTemplate]
LocFriendlyName="Gas Stike"
LocLongDescription="Calls in an Orbital Gas Strike on the target area."
LocHelpText="Call Orbital Gas Strike."
LocFlyOverText="Call Orbital Gas Strike"

[CallAdvancedGasStrike X2AbilityTemplate]
LocFriendlyName="Advanced Gas Strike"
LocLongDescription="Calls in an Orbital Gas Strike on the target area."
LocHelpText="Call Orbital Gas Strike."
LocFlyOverText="Call Orbital Gas Strike"





;BIO VIPER
[BioViperSilver X2CharacterTemplate]
strCharacterName="Bio Viper"

[BioViperGold X2CharacterTemplate]
strCharacterName="Elite Bio Viper"

[CorpseBioViper X2ItemTemplate]
FriendlyName="<font color='#69CA24'>Bio Viper Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Viper Corpses</font>"
BriefSummary="This new breed of Viper looks to be created from the base Viper's DNA. But has been heavily modified with new abilities and traits."

[CorpseEliteBioViper X2ItemTemplate]
FriendlyName="<font color='#69CA24'>Elite Bio Viper Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>Elite Bio Viper Corpses</font>"
BriefSummary="This new breed of Viper looks to be created from the base Viper's DNA. But has been heavily modified with new abilities and traits."

[AutopsyBioViper X2TechTemplate]
DisplayName="<font color='#69CA24'>Bio Viper Autopsy</font>"
Summary="The Bio Viper is the newest evolution to the Viper. Quick, deadly and very toxic."
CodeName="Biohazard"
LongDescription="This new Viper is much more deadly than its predecessor. It seems to have hardened scales that have formed into spikes that can punctured and give off a deadly Bio Toxin. It also leaves a deadly acid trail in its wake as it moves. It still possesses the poison spit ability and crushing bind ability but has given up the tongue pull for more mobility and quickness."

[AutopsyEliteBioViper X2TechTemplate]
DisplayName="<font color='#69CA24'>Elite Bio Viper Autopsy</font>"
Summary="The Elite Bio Viper is much like the Bio Viper, only she is faster, has more health and can cause blindness with her poison spit."
CodeName="Biohazard"
LongDescription="The Elite Bio Viper seems to be an even further modified viper. She is quicker, has more health and her venom glands have been modified to excrete poison that will also cause blindness."


[PoisonBlindSpit X2AbilityTemplate]
LocFriendlyName="Toxin Spit"
LocLongDescription="A Toxic Spit attack on multiple targets that will cause the targets to become blind as well as poisoned."
LocHelpText="Spits a Toxic attack at a multiple targets."
LocFlyOverText="Toxin Spit"

[BioViperAcidBlood X2AbilityTemplate]
LocFriendlyName="Acid Blood"
LocFlyOverText="Acid Blood"
LocHelpText="Bleeds Acid when damage is taken."
LocLongDescription="Bleeds Acid when damage is taken."

[AcidDeathExplosion X2AbilityTemplate]
LocFriendlyName="Acid Death"
LocLongDescription="When the Bio Viper is killed she will explode dealing Acid damage to the area."
LocHelpText="Acid Death explosion to area."
LocFlyOverText="Acid Death"





;BIO FACELESS
[BioFaceless X2CharacterTemplate]
strCharacterName="Bio Faceless"

[BioFacelessM2 X2CharacterTemplate]
strCharacterName="Bio Faceless"

[CorpseBioFaceless X2ItemTemplate]
FriendlyName="<font color='#69CA24'>Bio Faceless Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Faceless Corpses</font>"
BriefSummary="Like that of the base Faceless, whatever remains the Faceless leave behind dissolve rapidly into a foul smelling paste. However, the Bio Faceless will also leave behind a toxic and very deadly radioactive gas that needs to be contained."

[AutopsyBioFaceless X2TechTemplate]
DisplayName="<font color='#69CA24'>Bio Faceless Autopsy</font>"
Summary="As if the Faceless alien wasn't bad enough, now Advent's Bio Division is tampering with the Faceless to create this new bio creation. Our soldiers will need to stay a distance away, these Bio Faceless extrude mass amounts of radiation."
CodeName="Swamp Thing"
LongDescription="Just as I've feared Commander. The ADVENT Bio Division is crealy not content with just bio genetic manipulation of ADVENT soldiers. This new breed of Faceless is far more deadly than its smaller counterpart. Not only does this Bio Faceless carry on all traits of the Faceless, they are now highly bio contagious. I may need to advance our current Mediket tech so Shen can start building us more advanced ways to heal and stay immune to new threats such as this. R. Tygan."
AlertString="Bio Faceless"

[BioFacelessRegeneration X2AbilityTemplate]
LocFriendlyName="Bio Faceless Regeneration"
LocLongDescription="The Bio Faceless recovers 3 health at the start of its turn."
LocHelpText="The Bio Faceless recovers a small amount of HP every turn."
LocFlyOverText="Regeneration"

[BioFaceless_MeleeAoE X2WeaponTemplate]
FriendlyName="Bio Scything Claws"

[BioFacelessM2_MeleeAoE X2WeaponTemplate]
FriendlyName="Bio Scything Claws"

[BioScythingClaws X2AbilityTemplate]
LocFriendlyName="Bio Scything Claws"
LocLongDescription="Attack with Scything Claws adding Radiation Poisoning to any targets damaged."
LocHelpText="Strikes with a Scything Attack. All targets that are damaged will take Radiation Poisoning."
LocFlyOverText="Bio Scything Claws"     

[BioScythingClawsM2 X2AbilityTemplate]
LocFriendlyName="Bio Scything Claws"
LocLongDescription="Attack with Scything Claws adding Radiation Poisoning to any targets damaged."
LocHelpText="Strikes with a Scything Attack. All targets that are damaged will take Radiation Poisoning."
LocFlyOverText="Bio Scything Claws" 




;BIOZERKER
[BioZerker X2CharacterTemplate]
strCharacterName="BioZerker"

[CorpseBioZerker X2ItemTemplate]
FriendlyName="<font color='#69CA24'>BioZerker Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>BioZerker Corpses</font>"
BriefSummary="These hulking monstrosities may have once been normal, if we can even call Berserkers \"normal\". But because of their Bio nature, we should take extra precaution when performing the autopsy."

[AutopsyBioZerker X2TechTemplate]
DisplayName="<font color='#69CA24'>BioZerker Autopsy</font>"
Summary="The BioZerker or Hulk as the soldiers have code named it, is a massive hulking monstrosity created to possibly replace its smaller counterparts."
CodeName="Hulk"
LongDescription="Different from their smaller counterparts, the BioZerker, as our scientists call it, is effectively a whole different type of creature. Advent's Bio Division’s work on the Berserker’s gene structure is something to be in awe over. The creature’s height and muscle mass has been increased to the point that it dwarfs even the pre-invasion Muton, which, according to Central Officer Bradford, was bigger than the current Mutons. What is most strange, however, is its blood. It contains traces of the same Bio Elerium chemical found in the alien pods from the abandoned cities, acting as an artificial steroid. The canisters on its back look to hold a Bio Elerium substance used to feed these beasts and keep them going, in addition to aiding its growth. The plate installed on the creature’s head, probably for additional protection, does not seem like it is needed for much else other than an added fear factor. I did find something astonishing! When its body takes trama, the canisters will instantly flood the creature with added toxins. The Bio Elerium substance will also form an internal mucus that hardens and acts as added armor to fend off damage. My warning to our Soldiers when engaging Berserkers at long range also applies to these new BioZerkers Commander. I can not stress this enough. R. Tygan."
AlertString="BioZerker"

[BioDamageControl X2AbilityTemplate]
LocFriendlyName="Armor Generation"
LocLongDescription="Floods the body with a mucus-like agent that hardens to form a temporary armor."
LocHelpText="Bio Damage Control Armor Generation. 1 Armor generated each time damage is taken for that round of combat. Resets the start of the next combat phase."
LocFlyOverText="Armor Generation" 

[BioZerker_DeathCloud X2AbilityTemplate]
LocFriendlyName="Bio Vapor Cloud"
LocLongDescription="A Bio gas vapor that will cause instant thermo burns to all organic tissue as well as deal poison effects."
LocHelpText="Bio Vapor Cloud."
LocFlyOverText="Bio Vapor Cloud"

[BioZerkerRegeneration X2AbilityTemplate]
LocFriendlyName="BioZerker Regeneration"
LocLongDescription="The BioZerker recovers 5 health at the start of the next turn. Max of 5 turns for 25 health."
LocHelpText="The BioZerker recovers some HP a turn."
LocFlyOverText="Regeneration"

[ZerkerPunt X2AbilityTemplate]
LocFriendlyName="BioZerker Punch"
LocLongDescription="The BioZerker will punch at targets that get too close. This punch can also do Stun or knock out targets."
LocHelpText="BioZerker Punch."
LocFlyOverText="BioZerker Punch"

[BioZerker_DeathCloud_Wpn X2WeaponTemplate]
FriendlyName="BioZerker Vapor Cloud"

[BioZerker_PuntAttack X2WeaponTemplate]
FriendlyName="BioZerker Punch"




;BIO LOST
[BioLost X2CharacterTemplate]
strCharacterName="Bio Lost"

[BioLostBleeder X2CharacterTemplate]
strCharacterName="Bio Lost Bleeder"

[CorpseBioLost X2ItemTemplate]
FriendlyName="<font color='#69CA24'>Bio Lost Corpse</font>"
FriendlyNamePlural="<font color='#69CA24'>BioLost Corpses</font>"
BriefSummary="The Bio Division are clearly very disturbed in many regards. Not only are they turning aliens into bio enhanced monstrosities, but now Lost as well. These corpses are far to dangerous to do anything with. Maybe the Black Market will take them off our hands."


[BioLostAcidTrail_Passive X2AbilityTemplate]
LocFriendlyName="Bio Lost Acid Blood"
LocLongDescription="The Bio Lost Bleeder leaves a trail of acid blood as it moves."
LocHelpText="The Bio Lost Bleeder leaves a trail of acid blood as it moves."

[TriggerBioDestruct X2AbilityTemplate]
LocFriendlyName="Bio Lost Collar Bomb"
LocLongDescription="The Bio Lost is fitted with an explosive collar. This collar controls the Lost and directs it to an enemy target, where the Bio Lost's acid filled body is used as a bio bomb."
LocHelpText="The Bio Lost is fitted with an explosive collar. This collar controls the Lost and directs it to an enemy target, where the Bio Lost's acid filled body is used as a bio bomb."





;ITEMS/AMMO/EQUIPMENT/ABILITIES for XCOM
[BioCanister X2ItemTemplate]
FriendlyName="<font color='#69CA24'>Bio Radioactive Elerium Canister</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Radioactive Elerium Canisters</font>"
BriefSummary="The Bio Radioactive Elerium Canisters will flood the host with added toxins, as well as a Radioactive Elerium mucus-like compound that hardens and acts as added armor to fend off damage."

[PCSBioDamageControl X2EquipmentTemplate]
FriendlyName="<font color='#69CA24'>PCS: Bio Damage Control</font>"
FriendlyNamePlural="<font color='#69CA24'>PCS: Bio Damage Control</font>"
BriefSummary="Floods the body with a reworked mucus-like agent that hardens to form a temporary armor as well as granting a small defense bonus."

; --------------------------------
;         Rad Rounds   RENAMED TO ELERIUM ROUNDS
; --------------------------------
[EleriumRounds X2AbilityTemplate]
LocFriendlyName="Elerium Rounds"

[RadRounds X2AmmoTemplate]
FriendlyName="<font color='#69CA24'>Elerium Rounds</font>"
FriendlyNamePlural="<font color='#69CA24'>Elerium Rounds</font>"
BriefSummary="Loaded with trace ammounts of the same toxin filled Bio Elerium, these rounds inflict elerium poisoning as well as random neurological effects that will cause mobility and aim stat decreases to oganic units."
TacticalText="<Bullet/> These rounds deal elerium poisoning which causes -5 mobility -35 aim and have a chance to stun. Deals 1 bonus damage to organic units.\n"


[UIEventNoticesTactical]
EleriumPoisoningTitle="Elerium Poisoning"

[X2Effect_EleriumPoisoning]
EleriumPoisoningFriendlyName="Elerium Poisoning"
EleriumPoisoningFriendlyDesc="Suffering movement and aim penalties. Taking damage each turn."
EleriumPoisoningEffectAcquiredString="<XGParam:StrValue0/!UnitName/> has Elerium Poisoning."
EleriumPoisoningEffectTickedString="<XGParam:StrValue0/!UnitName/> still has Elerium Poisoning."
EleriumPoisoningEffectLostString="<XGParam:StrValue0/!UnitName/> no longer has Elerium Poisoning."

[Biomedikit X2WeaponTemplate]
FriendlyName="<font color='#69CA24'>Biomedikit</font>"
FriendlyNamePlural="<font color='#69CA24'>Biomedikits</font>"
BriefSummary="The Biomedikit is an upgrade to the Nanomedikit. It grants up to 6 health restored to injured soldiers, while giving the same immunities as the Nanomedikit and offering additional immunity to elerium poisoning. Grants 1 additional heal charge."
TacticalText="<Bullet/> A Biomedikit can restore <Ability:NANOMEDIKITHEALHP/>HP to a single soldier.\n<Bullet/> Like other Medikits, a Biomedikit can remove negative environmental effects from soldiers and can stabilize soldiers that are bleeding out.\n<Bullet/> Carrying a BioMedikit grants immunity to poison and elerium poisoning and grants 1 additional heal charge.\n<Bullet/> Does not affect robotic allies.\n"

[Medikit X2WeaponTemplate]
FriendlyName="Medikit"
FriendlyNamePlural="Medikits"
BriefSummary="The Medikit contains a pressurized solution that, when exposed to air, acts as a sealant and insulator. Infused with painkillers and antiseptics, the Medikit can treat wounds and remove a variety of adverse conditions, including burns and poison."
TacticalText="<Bullet/> A Medikit can restore <Ability:MEDIKITPERUSEHP/>HP to a single soldier.\n<Bullet/> A Medikit can also be used to remove Burning, Acid, Frost, Blind and Poison effects from any soldier.\n<Bullet/> A Medikit can also be used to stabilize a soldier that is bleeding out.\n<Bullet/>A Medikit only has a single charge, and if used on allies, they must be in an adjacent tile.\n<Bullet/> Does not affect robotic allies.\n"

[BioNanoScaleVest X2EquipmentTemplate]
FriendlyName="<font color='#69CA24'>Bio Nanoscale Vest</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Nanoscale Vests</font>"
BriefSummary="The Bio Division's own version of the Nano Scale Vest. It grants a better boost to soldier health along with an increase in armor and Acid resistance."
TacticalText="<Bullet/> Gives a soldier 2 bonus health.\n<Bullet/> Also, increases armor by 2 and grants Acid Immunity"

[BioViperScaleVest X2EquipmentTemplate]
FriendlyName="<font color='#69CA24'>Bio Viper Scale Vest</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Viper Scale Vests</font>"
BriefSummary="Upgraded Nano Scale Vest that adds the Bio Viper Scales and immunities."
TacticalText="<bullet/> Increases soldier mobility by 2, and defense by 3.\n<bullet/> Provides immunity to poison, acid and prevents Viper Crush."

[AdvancedBioViperScaleVest X2EquipmentTemplate]
FriendlyName="<font color='#69CA24'>Advanced Bio Viper Scale Vest</font>"
FriendlyNamePlural="<font color='#69CA24'>Advanced Bio Viper Scale Vests</font>"
BriefSummary="Upgraded Bio Viper Scale Vest that adds the Elite Bio Viper Scales and immunities."
TacticalText="<bullet/> Increases soldier health by 1, mobility by 2, and defense by 3.\n<bullet/> Provides immunity to poison, acid, blind and prevents Viper Crush."

[CallSatStrike X2AbilityTemplate]
LocFriendlyName="Sat Strike"
LocLongDescription="Calls in an Orbital Satellite Strike on the target area."
LocHelpText="Call Orbital Sat Strike."
LocFlyOverText="Call Orbital Sat Strike"

[CallSatStrike2 X2AbilityTemplate]
LocFriendlyName="Stike Inbound"
LocLongDescription="The Orbital Strike can not target enemies within structures but the damage of the strike may kill or wound anything within a structure."

[SatStrikeModule X2WeaponTemplate]
FriendlyName ="Sat Strike Module"
FriendlyNamePlural="Sat Strike Modules"
TacticalText= "<bullet/> A Sat Strike Module can only be used once per mission.\n<bullet/> The strike from the orbiting Satellite will cause massive explosion damage to the target area."
BriefSummary= "The Sat Strike does greater damage than the ADVENT orbital Strikes. Will destroy cover and buildings if in the target area."



;WEAPONS
[BioViper_WPN X2WeaponTemplate]
FriendlyName="Bio Viper Beam Rifle"

[EliteBioViper_WPN X2WeaponTemplate]
FriendlyName="Elite Bio Viper Plasma Rifle"

[BioRocket_Launcher X2WeaponTemplate]
FriendlyName="ADVENT Bio Rocket Launcher"

[BioBlasteLauncher X2WeaponTemplate]
FriendlyName="ADVENT Bio Blaster Launcher"

[BioCaptainM1_SMG_WPN X2WeaponTemplate]
FriendlyName="Advent Mag SMG"

[BioCaptainM2_SMG_WPN X2WeaponTemplate]
FriendlyName="Advent Mag SMG"

[BioCaptainM3_SMG_WPN X2WeaponTemplate]
FriendlyName="Advent Mag SMG"

[AdvBioSaberM2 X2WeaponTemplate]
FriendlyName="Advent Bio Saber"

[AdvBioSaberM3 X2WeaponTemplate]
FriendlyName="Advent Bio Saber"

[AdvBioShieldM2 X2WeaponTemplate]
FriendlyName="Advent Bio Shield"

[AdvBioShieldM3 X2WeaponTemplate]
FriendlyName="Advent Bio Shield"

[BioAssaultTrooperM2_Shotgun_WPN X2WeaponTemplate]
FriendlyName="Advent Mag Shotgun"

[BioAssaultTrooperM3_Shotgun_WPN X2WeaponTemplate]
FriendlyName="Advent Mag Shotgun"

[AdvBioStunLanceM2 X2WeaponTemplate]
FriendlyName="Bio Stun Lance"

[AdvBioStunLanceM3 X2WeaponTemplate]
FriendlyName="Bio Stun Lance"

[TacticalHeavyPlasmaShotgun X2WeaponTemplate]
FriendlyName="Tactical Heavy Plasma Shotgun"

[TacticalHeavyPlasmaRifle X2WeaponTemplate]
FriendlyName="Tactical Heavy Plasma Rifle"

[HeavyBioPlasmaThrower X2WeaponTemplate]
FriendlyName="Heavy Plasma Flamethrower"
FriendlyNamePlural="Heavy Plasma Flamethrowers"
BriefSummary="Heavy Plasma Flamethrower"
TacticalText="Heavy Plasma Flamethrower"
AbilityDescName="Heavy Plasma Flamethrower"

[Weapon_BioRocket X2WeaponTemplate]
FriendlyName ="Bio Rocket Launcher"
FriendlyNamePlural="Bio Rocket Launchers"
TacticalText= "<bullet/> The Bio Rocket Launcher can only be used once per mission.\n<bullet/> The rocket fired from this launcher explodes on impact, imapling the target with Toxic thorns while showering the immediate area with acid.\n<bullet/> Must be deployed with heavy armor."
BriefSummary= "This new Rocket Launcher, created from the study of the Bio Viper does slightly less base damage compaired to the standard rocket launcher but when used with the new Bio Rocket, the added Bio Acid explosion will make most Aliens run for cover."

[BioBlasterLauncherXCom X2WeaponTemplate]
FriendlyName ="<font color='#69CA24'>Bio Blaster Launcher</font>"
FriendlyNamePlural="<font color='#69CA24'>Bio Blaster Launchers</font>"
TacticalText= "<bullet/> The Bio Blaster Launcher can only be used once per mission.\n<bullet/> The Bio Blaster Bomb fired from a launcher explodes on impact, doing base explosion damage as well as acid damage.\n<bullet/> Must be deployed with heavy armor."
BriefSummary= "This Bio Blaster Launcher does the same damage as its base counterpart, but shreds 4 armor, 1 more armor than standard Blaster Launcher. This is due to the corrosive nature of the added Bio Acid. Bio Acid will burn all enemies unless immune to Acid. These projectiles can navigate around bloking terrain and can be fired from extreme range."




;TECH/RESEARCH
[ProvingGroundsProject_BioRocket X2TechTemplate]
DisplayName="<font color='#69CA24'>Bio Rockets</font>"
Summary="Poison Acid Rocket"
CodeName="BOOM"
LongDescription="This new Bio Rocket is designed to work with the Bio Rocket Launcher. Its warhead is filled with Bio Poison Acid which covers an area on impact."

[AdvancedBattlefieldMedicine X2TechTemplate]
DisplayName="<font color='#69CA24'>Advanced Battlefield Medicine</font>"
Summary="The thought of being ripped open by the long, deadly claws of a Faceless is bad enough. Now that ADVENT has these Bio Faceless, we may need to advance our medical tech farther. Stronger coagulant, stronger antidotes and more of it is always good right?" 




;BIO IMMUNITIES
[BioImmunities X2AbilityTemplate]
LocFriendlyName="Bio Immunities"
LocLongDescription="Immune to poison, acid and Chryssalid poison."
LocHelpText="Immune to poison, acid and Chryssalid poison."

[BioViperImmunities X2AbilityTemplate]
LocFriendlyName="Bio Viper Immunities"
LocLongDescription="Immune to poison, acid, blind effects and Chryssalid poison."
LocHelpText="Immune to poison, acid, blind effects and Chryssalid poison."

[BioBeastImmunities X2AbilityTemplate]
LocFriendlyName="Bio Beast Immunities"
LocLongDescription="Immune to poison, acid, Elerium poisoning and Chryssalid poison."
LocHelpText="Immune to poison, acid, Elerium poisoning and Chryssalid poison."

[BioGeneralImmunities X2AbilityTemplate]
LocFriendlyName="Bio General Immunities"
LocLongDescription="Immune to poison, acid, Chryssalid poison and Mental statuses."
LocHelpText="Immune to poison, acid, Chryssalid poison and Mental statuses."

[BioLostImmunities X2AbilityTemplate]
LocFriendlyName="Bio Lost Immunities"
LocLongDescription="Immune to poison, acid, Chryssalid poison, Elerium poisoning and Mental statuses."
LocHelpText="Immune to poison, acid, Chryssalid poison, Elerium poisoning and Mental statuses."

[BioMecImmunities X2AbilityTemplate]
LocFriendlyName="Bio Mec Immunities"
LocLongDescription="Immune to poison, acid, Chryssalid poison, Elerium poisoning and fire."
LocHelpText="Immune to poison, acid, Chryssalid poison, Elerium poisoning and fire."




;SITREPS
[BioTroopDeployment X2SitRepTemplate]
FriendlyName="Bio Troop Deployment"
Description="Heavy Bio Troop numbers to be deployed on this mission."

[BioTroopDeploymentEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Bio Troop Deployment"
Description="The ADVENT Bio Division is pressing XCom hard. They are deploying a larger Bio Force to the AO to try and hault XCom's advance."

[BioPurge X2SitRepTemplate]
FriendlyName="Bio Purge"
Description="The ADVENT Bio Division has dropped Bio Beast units in and looking to cleanse the area."

[BioPurgeEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Bio Purge"
Description="The ADVENT Bio Division is attempting to purged this area of dissidents. They have deployed larger Bio Beast units to track down and remove any remaining survivors."




